In [1]:
import pandas as pd

In [5]:
df = pd.read_excel('https://www.sharkattackfile.net/spreadsheets/GSAF5.xls')
df.head()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Species,Source,pdf,href formula,href,Case Number,Case Number.1,original order,Unnamed: 21,Unnamed: 22
0,15 Mar 2024,2024.0,Unprovoked,AUSTRALIA,Queensland,Bargara Beach,Swimming,Brooklyn Sauer,F,13,...,Tiger shark,"Yahoo News, 3/15/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,04 Mar 2024,2024.0,Unprovoked,USA,Hawaii,"Old Man's, Waikiki",Surfing,Matthew White,M,NaN,...,Tiger shark 8',"Surfer, 3/6/2024F",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,02 Mar-2024,2024.0,Unprovoked,USA,Hawaii,"Rainbows, Oahu",Swimming,NaN,F,11,...,3' to 4' shark,"Hawaii News Now, 3/4/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,25 Feb-2024,2024.0,Unprovoked,AUSTRALIA,Western Australia,"Sandlnd Island, Jurian Bay",NaN,female,F,46,...,Tiger shark,"WA Today, 2/26/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,14 Feb-2024,2024.0,Unprovoked,INDIA,Maharashtra,"Vaitarna River, Palghar District",Fishing,Vicky Suresh Govari,M,32,...,"Bull shark, 7'","Times of India, 2/14/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
#check datatypes
df.dtypes

Date               object
Year              float64
Type               object
Country            object
State              object
Location           object
Activity           object
Name               object
Sex                object
Age                object
Injury             object
Unnamed: 11        object
Time               object
Species            object
Source             object
pdf                object
href formula       object
href               object
Case Number        object
Case Number.1      object
original order    float64
Unnamed: 21        object
Unnamed: 22        object
dtype: object

In [8]:
#nr rows, nr columns
df.shape

(6969, 23)

In [27]:
#split dataset into categorical and numerical
categorical_data = df[["Type","Country","State","Location","Activity","Name","Sex","Injury","Unnamed: 11","Source"]]
numerical_data = df[["Date","Year","Age","Time"]]

In [17]:
#basic statistics for categorical_data:
categorical_data.describe()

,Type,Country,State,Location,Activity,Name,Sex,Injury,Unnamed: 11,Source
count,6926,6894,6462,6379,6358,6724,6365,6909,6382,6925
unique,12,225,902,4514,1587,5683,8,4079,12,5302
top,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,FATAL,N,"K. McMurray, TrackingSharks.com"
freq,5107,2538,1178,191,1121,680,5578,863,4832,131

In [18]:
#describe the unique values of each categorical column 
categorical_data.nunique()

Type             12
Country         225
State           902
Location       4514
Activity       1587
Name           5683
Sex               8
Injury         4079
Unnamed: 11      12
Source         5302
dtype: int64

In [23]:
#basic statistics for numerical_data:
numerical_data.describe()

              Year
count  6942.000000
mean   1934.403342
std     272.920956
min       0.000000
25%    1947.000000
50%    1985.000000
75%    2009.000000
max    2024.000000

In [24]:
numerical_data.nunique()

Date    6003
Year     259
Age      243
Time     410
dtype: int64